app/graphql/types/mutation_type.rb

INSERT INTO "sections" ("name", "created_at", "updated_at") VALUES ('Dairy', '2026-01-16 00:25:32.933128', '2026-01-16 00:25:32.933128') RETURNING "id"
---
    def create_section(name:)
      Section.create!(name: name)

SELECT "sections".* FROM "sections" WHERE "sections"."id" = 2 LIMIT 1
UPDATE "sections" SET "name" = 'Freezer', "updated_at" = '2026-01-16 22:11:13.836943' WHERE "sections"."id" = 1
---
    def update_section(id:, name: nil)
      section = Section.find(id)
      input = { name: name }.compact
      section.update!(input)

INSERT INTO "ingredients" ("name", "created_at", "updated_at", "section_id") VALUES ('Lettuce', '2026-01-16 00:19:03.302936', '2026-01-16 00:19:03.302936', 2) RETURNING "id"
---
    def create_ingredient(name:, section:)
      Ingredient.create!(name: name, section_id: section)

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = 1 LIMIT 1
UPDATE "ingredients" SET "name" = 'Yogurt', "updated_at" = '2026-01-16 22:21:07.857290', "section_id" = 2 WHERE "ingredients"."id" = 1
---
    def update_ingredient(id:, name: nil, section: nil)
      ingredient = Ingredient.find(id)
      input = { name: name, section_id: section }.compact
      ingredient.update!(input)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = 1 LIMIT 1
UPDATE "recipes" SET "name" = 'Breakfast Yogurt', "updated_at" = '2026-01-16 22:27:15.458214' WHERE "recipes"."id" = 1
---
    def update_recipe(id:, name: nil, ingredients: nil)
      recipe = Recipe.find(id)
      input = { name: name, ingredient_ids: ingredient }.compact
      recipe.update!(input)

INSERT INTO "recipes_shopping_lists" ("recipe_id", "shopping_list_id") VALUES (2, 1) RETURNING "id"
---
    def create_shopping_list(name: nil, recipes: [], ingredients: [])
      ShoppingList.create!(name: name, recipe_ids: recipes, ingredient_ids: ingredients)

SELECT "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."id" = 1 LIMIT 1
UPDATE "shopping_lists" SET "name" = NULL, "updated_at" = '2026-01-16 22:33:19.043342' WHERE "shopping_lists"."id" = 1
---
    def update_shopping_list(id:, name: nil, recipes: nil, ingredients: nil)
      shopping_list = ShoppingList.find(id)
      input = { name: name, recipe_ids: recipes, ingredient_ids: ingredients }.compact
      shopping_list.update!(input)