app/graphql/types/mutation_type.rb

    def delete_section(id:)
      section = Section.find(id)
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = 2 LIMIT 1

    def delete_ingredient(id:)
      ingredient = Ingredient.find(id)
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = 3

    def update_recipe(id:, name: nil, ingredients: nil)
      recipe = Recipe.find(id)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" IN (1, 2)