app/graphql/types/query_type.rb

SELECT "shopping_lists".* FROM "shopping_lists" ORDER BY "shopping_lists"."id" DESC LIMIT 10
---
    def shopping_lists
      ShoppingList.last(10)